[
    {
        "title": "ในทฤษฎีสัมพัทธภาพทั่วไปของไอน์สไตน์ การบิดเบือนของเวลาและอวกาศจะเกิดขึ้นจากอะไร?",
        "options": [
            "มวล",
            "พลังงาน",
            "สนามแม่เหล็ก",
            "ความเร็วแสง",
            "แรงโน้มถ่วง"
        ],
        "answer": 1,
        "correct": "ทฤษฎีสัมพัทธภาพทั่วไปกล่าวว่าอวกาศและเวลาจะบิดเบือนโดยมวลและพลังงาน ซึ่งเป็นสาเหตุของแรงโน้มถ่วง"
    },
    {
        "title": "อะไรคือลักษณะสำคัญของอะตอมในสถานะของสสารในระดับควอนตัม?",
        "options": [
            "อนุภาคที่ไม่มีมวล",
            "การเคลื่อนที่เป็นเส้นตรง",
            "สถานะของพลังงานที่ไม่สามารถคาดเดาได้",
            "การหมุนรอบศูนย์กลาง",
            "พฤติกรรมที่สามารถสังเกตได้"
        ],
        "answer": 3,
        "correct": "ในฟิสิกส์ควอนตัม อนุภาคมักจะอยู่ในสถานะพลังงานที่ไม่สามารถคาดเดาได้"
    },
    {
        "title": "กฎข้อใดในฟิสิกส์ที่เกี่ยวข้องกับการอนุรักษ์พลังงาน?",
        "options": [
            "กฎของนิวตัน",
            "กฎของความโน้มถ่วง",
            "กฎของการอนุรักษ์พลังงาน",
            "กฎของการคงที่มวล",
            "กฎของการแพร่กระจาย"
        ],
        "answer": 3,
        "correct": "กฎของการอนุรักษ์พลังงานกล่าวว่า พลังงานไม่สามารถสร้างหรือทำลายได้ แต่จะเปลี่ยนรูปจากรูปหนึ่งไปยังอีกรูปหนึ่ง"
    },
    {
        "title": "อะตอมสามารถถูกแบ่งแยกได้หรือไม่?",
        "options": [
            "ไม่สามารถถูกแบ่งแยกได้",
            "สามารถแบ่งแยกได้ในกระบวนการเคมี",
            "สามารถแบ่งแยกได้ในกระบวนการนิวเคลียร์",
            "สามารถแบ่งแยกได้ในทุกกรณี",
            "สามารถแบ่งแยกได้เฉพาะในสภาวะที่ร้อนจัด"
        ],
        "answer": 3,
        "correct": "อะตอมสามารถถูกแบ่งแยกได้ในกระบวนการนิวเคลียร์ เช่น ในการฟิชชั่นและฟิวชั่น"
    },
    {
        "title": "อะไรคือสสารที่ทำให้เกิดแรงดึงดูดบนโลก?",
        "options": [
            "แสง",
            "มวล",
            "แรงไฟฟ้า",
            "พลังงาน",
            "การเคลื่อนที่"
        ],
        "answer": 2,
        "correct": "แรงดึงดูดบนโลกเกิดจากแรงโน้มถ่วงที่มีผลต่อมวล"
    },
    {
        "title": "ใครคือผู้ที่เสนอทฤษฎีควอนตัม?",
        "options": [
            "ไอน์สไตน์",
            "แมกซ์ พลังก์",
            "นีลส์ บอร์",
            "เดวิด โบห์ม",
            "ลูอิส ดีบรูยน์"
        ],
        "answer": 2,
        "correct": "แมกซ์ พลังก์เป็นผู้ที่เสนอทฤษฎีควอนตัมโดยการนำเสนอแนวคิดของ 'ควอนตัม' หรือ 'แพ็คเกจพลังงาน'"
    },
    {
        "title": "ทฤษฎีอะไรที่อธิบายถึงพฤติกรรมของสสารในระดับควอนตัม?",
        "options": [
            "ทฤษฎีสัมพัทธภาพพิเศษ",
            "ทฤษฎีสัมพัทธภาพทั่วไป",
            "ทฤษฎีควอนตัม",
            "ทฤษฎีกระแสไฟฟ้า",
            "ทฤษฎีความร้อน"
        ],
        "answer": 3,
        "correct": "ทฤษฎีควอนตัมอธิบายถึงพฤติกรรมของสสารและพลังงานในระดับอะตอมและอนุภาค"
    },
    {
        "title": "อะไรคือสมบัติของอนุภาคในทฤษฎีควอนตัม?",
        "options": [
            "สามารถอยู่ในหลายสถานะพร้อมกัน",
            "มีพฤติกรรมเชิงเส้น",
            "ไม่สามารถวัดได้",
            "มีมวลเป็นศูนย์",
            "เคลื่อนที่ในแนวตั้งเท่านั้น"
        ],
        "answer": 1,
        "correct": "ในทฤษฎีควอนตัม อนุภาคสามารถอยู่ในหลายสถานะพร้อมกัน ซึ่งเรียกว่า 'การซ้อนทับ' (superposition)"
    },
    {
        "title": "สสารมืดมีบทบาทอะไรในจักรวาล?",
        "options": [
            "มันให้แสงและความร้อน",
            "มันเป็นแหล่งพลังงาน",
            "มันมีผลต่อแรงโน้มถ่วง",
            "มันทำให้เกิดดาวฤกษ์ใหม่",
            "มันเป็นพลังงานที่ไม่สามารถมองเห็นได้"
        ],
        "answer": 3,
        "correct": "สสารมืดมีผลต่อแรงโน้มถ่วงและเชื่อว่าเป็นสาเหตุหลักที่ทำให้จักรวาลขยายตัว"
    },
    {
        "title": "ในระบบสุริยะ ดาวเคราะห์ใดที่มีแรงโน้มถ่วงสูงสุด?",
        "options": [
            "โลก",
            "ดาวพฤหัสบดี",
            "ดาวเสาร์",
            "ดาวอังคาร",
            "ดาวยูเรนัส"
        ],
        "answer": 2,
        "correct": "ดาวพฤหัสบดีมีมวลมากที่สุดในระบบสุริยะ ซึ่งทำให้มีแรงโน้มถ่วงสูงสุด"
    },
    {
        "title": "อะไรคือคำอธิบายของทฤษฎีบิ๊กแบง?",
        "options": [
            "จักรวาลเกิดจากการระเบิดของสสาร",
            "จักรวาลเริ่มต้นจากการขยายตัวจากจุดเล็ก ๆ",
            "จักรวาลเริ่มจากการมีสสารและพลังงานเต็มไปหมด",
            "จักรวาลเริ่มต้นจากการหมุนรอบ",
            "จักรวาลไม่มีจุดเริ่มต้น"
        ],
        "answer": 2,
        "correct": "ทฤษฎีบิ๊กแบงกล่าวว่า จักรวาลเริ่มต้นจากการขยายตัวจากจุดที่มีความหนาแน่นสูงมาก"
    },
    {
        "title": "ในการศึกษาชีววิทยา พันธุกรรมเป็นการถ่ายทอดลักษณะจากอะไร?",
        "options": [
            "เซลล์",
            "DNA",
            "สารเคมี",
            "เซลล์ประสาท",
            "โปรตีน"
        ],
        "answer": 2,
        "correct": "พันธุกรรมเกิดจากการถ่ายทอดลักษณะทางพันธุกรรมที่อยู่ใน DNA"
    },
    {
        "title": "กระบวนการสังเคราะห์แสงเกิดขึ้นที่ไหนในพืช?",
        "options": [
            "ราก",
            "ใบ",
            "ดอก",
            "ลำต้น",
            "ผล"
        ],
        "answer": 2,
        "correct": "กระบวนการสังเคราะห์แสงเกิดขึ้นในคลอโรพลาสต์ในใบของพืช"
    },
    {
        "title": "อะไรคือผลของการสืบพันธุ์แบบไม่อาศัยเพศ?",
        "options": [
            "ลูกหลานจะเหมือนกับพ่อแม่ทุกประการ",
            "ลูกหลานมีความหลากหลายทางพันธุกรรมสูง",
            "ลูกหลานจะมีลักษณะเฉพาะตัว",
            "ลูกหลานต้องใช้เวลานานในการเจริญเติบโต",
            "ลูกหลานต้องพึ่งพาการผสมพันธุ์"
        ],
        "answer": 1,
        "correct": "การสืบพันธุ์แบบไม่อาศัยเพศทำให้ลูกหลานมีลักษณะเหมือนกับพ่อแม่ทุกประการ"
    },
    {
        "title": "อะไรคือคุณสมบัติของเซลล์ต้นกำเนิด?",
        "options": [
            "สามารถแบ่งตัวได้ไม่จำกัด",
            "ไม่สามารถแบ่งตัวได้",
            "มีหน้าที่ในการสังเคราะห์โปรตีน",
            "มีรูปร่างเฉพาะ",
            "มีอายุสั้น"
        ],
        "answer": 1,
        "correct": "เซลล์ต้นกำเนิดสามารถแบ่งตัวได้ไม่จำกัดและสามารถพัฒนาเป็นเซลล์ชนิดต่าง ๆ"
    },
    {
        "title": "ทฤษฎีอะไรที่อธิบายการวิวัฒนาการของสิ่งมีชีวิต?",
        "options": [
            "ทฤษฎีวิวัฒนาการของดาร์วิน",
            "ทฤษฎีสัมพัทธภาพ",
            "ทฤษฎีการเคลื่อนที่ของพลศาสตร์",
            "ทฤษฎีพลังงาน",
            "ทฤษฎีควอนตัม"
        ],
        "answer": 1,
        "correct": "ทฤษฎีวิวัฒนาการของดาร์วินอธิบายว่าการเปลี่ยนแปลงของสิ่งมีชีวิตเกิดจากการคัดเลือกธรรมชาติ"
    },
    {
        "title": "การเคลื่อนที่ของอิเล็กตรอนในอะตอมถูกควบคุมโดยอะไร?",
        "options": [
            "สนามแม่เหล็ก",
            "พลังงาน",
            "แรงโน้มถ่วง",
            "สนามไฟฟ้า",
            "ความดัน"
        ],
        "answer": 4,
        "correct": "การเคลื่อนที่ของอิเล็กตรอนในอะตอมถูกควบคุมโดยสนามไฟฟ้า"
    },
    {
        "title": "อะไรคือปรากฏการณ์ที่เกี่ยวข้องกับการบิดเบือนของแสงเมื่อผ่านสสารที่มีความหนาแน่นสูง?",
        "options": [
            "การหักเหของแสง",
            "การสะท้อนของแสง",
            "การกระจายของแสง",
            "การดูดกลืนแสง",
            "การเปลี่ยนสีของแสง"
        ],
        "answer": 1,
        "correct": "การหักเหของแสงเกิดขึ้นเมื่อแสงผ่านสสารที่มีความหนาแน่นสูงและเปลี่ยนทิศทาง"
    },
    {
        "title": "แมวเป็นสัตว์ชนิดใด",
        "options": [
            "สัตว์เลี้ยงลูกด้วยนม",
            "สัตว์ปีก",
            "สัตว์น้ำ",
            "สัตว์เลื้อยคลาน",
            "สัตวแพทย์"
        ],
        "answer": 1,
        "correct": "สัตว์เลิ้ยงลูกด้วยนมจะนับรวมสัตว์ทั้งหมดที่เลี้ยงลูกด้วยนม"
    },
    {
        "title": "การทำงานของ wireless charging ใช้หลักการใด",
        "options": [
            "สนามแม่เหล็ก",
            "พลังงาน",
            "แรงโน้มถ่วง",
            "สนามไฟฟ้า",
            "ความดัน"
        ],
        "answer": 1,
        "correct": "สนามแม่เหล็กใช้การเหนี่ยวนำของอิเล็กตรอน"
    }
]
